# customer-processor - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda_identity_v1_event.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/customer_processor_identity_v1_event_retry_0]
module.common_resources.module.aws_lambda_identity_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.aws_lambda_identity_v1_event.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/customer_processor_identity_v1_event]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].aws_iam_role.lambda_role: Refreshing state... [id=le-customer_processor_identity_v1_event_retry_0]
module.common_resources.module.aws_lambda_identity_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_identity_v1_event.aws_iam_role.lambda_role: Refreshing state... [id=le-customer_processor_identity_v1_event]
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Read complete after 0s [id=upstash_kafka_credential_secret_name]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=83829b20-8ebf-4a92-ae35-f148eac45448:customer_processor]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:754682412926:secret:upstash_kafka_credential_718769-6sOfW6]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_identity_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_identity_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=3897813483]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=3897813483]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].aws_iam_role_policy_attachment.default: Refreshing state... [id=le-customer_processor_identity_v1_event_retry_0-20230527063311155200000002]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-customer_processor_identity_v1_event_retry_0:lambda-secrets-policy-customer_processor_identity_v1_event_retry_0]
module.common_resources.module.aws_lambda_identity_v1_event.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-customer_processor_identity_v1_event-20230527063311123700000001]
module.common_resources.module.aws_lambda_identity_v1_event.aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-customer_processor_identity_v1_event:lambda-secrets-policy-customer_processor_identity_v1_event]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-e2ed1589-7fcc-4bc6-944b-a6efe4e8f6d1]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-846279a5-28b3-4f18-acb7-1d0c1b6bbd38]
module.common_resources.module.aws_lambda_identity_v1_event.data.archive_file.default: Read complete after 1s [id=cd6727e335758e8d5164927a6f299dbd45c96053]
module.common_resources.module.aws_lambda_identity_v1_event.aws_lambda_function.default: Refreshing state... [id=customer_processor_identity_v1_event]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].data.archive_file.default: Read complete after 1s [id=cd6727e335758e8d5164927a6f299dbd45c96053]
module.common_resources.module.aws_lambda_identity_v1_event_retry[0].aws_lambda_function.default: Refreshing state... [id=customer_processor_identity_v1_event_retry_0]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_identity_v1_event_topic: Refreshing state... [id=e806369e-5610-4b87-b1b8-049732da48a4]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_identity_v1_event_retry_topics[0]: Refreshing state... [id=ff2f4881-634f-4bac-9d93-ddd3456adf49]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda_identity_v1_event.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "customer_processor_identity_v1_event"
      ~ last_modified                  = "2023-05-27T06:33:21.716+0000" -> (known after apply)
      ~ source_code_hash               = "C76gpxIgQNQHyKTwbtl1Kivg1n15ICPSaBaqpb5zuvs=" -> "tcq3chhQFf9X6QdNkgin+oH+5Xg/aOLdVHBFuyf0KNk="
        tags                           = {
            "domain"        = "customer"
            "environment"   = "staging"
            "resource"      = "customer-processor"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "cosmic-falcon-12173-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "4e852284fab04cfdae9a402b25dbe7cc"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "Y29zbWljLWZhbGNvbi0xMjE3MyQ1j5tLa6Ww9krXyINgI1t0-yplYB4blVRORfk"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_identity_v1_event_retry[0].aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "customer_processor_identity_v1_event_retry_0"
      ~ last_modified                  = "2023-05-27T06:33:29.074+0000" -> (known after apply)
      ~ source_code_hash               = "C76gpxIgQNQHyKTwbtl1Kivg1n15ICPSaBaqpb5zuvs=" -> "tcq3chhQFf9X6QdNkgin+oH+5Xg/aOLdVHBFuyf0KNk="
        tags                           = {
            "domain"        = "customer"
            "environment"   = "staging"
            "resource"      = "customer-processor"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "cosmic-falcon-12173-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "4e852284fab04cfdae9a402b25dbe7cc"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "Y29zbWljLWZhbGNvbi0xMjE3MyQ1j5tLa6Ww9krXyINgI1t0-yplYB4blVRORfk"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "83829b20-8ebf-4a92-ae35-f148eac45448:customer_processor"
        name       = "customer_processor"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "79c64fda-06df-4172-bd32-fe7136f7498c" -> "10130e8d-7e18-4541-853a-2efe9e949f93"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*